ggnguyen/eDongle/eDongle_final/msp430_nrf24l01p.c
	if (pipe > 5)
		return;
	if ( !(rf_feature & RF24_EN_ACK_PAY) )  // ACK payloads must be enabled...
		return;

	if (len % 2) {
		// Borrowing 'i' to extract STATUS...
		i = spi_transfer16( ((RF24_W_ACK_PAYLOAD | pipe) << 8) | (0x00FF & data[0]) );
		rf_status = (i & 0xFF00) >> 8;
		i = 1;
	} else {
		rf_status = spi_transfer(RF24_W_ACK_PAYLOAD | pipe);
	}
	for (; i < len; i+=2) {
		// SPI transfers MSB first
		spi_transfer16( (data[i] << 8) | (0x00FF & data[i+1]) );
	}
	CSN_DIS;
}






/* Configuration parameters used to set-up the RF configuration */
uint8_t rf_crc;
uint8_t rf_addr_width;
uint8_t rf_speed_power;
uint8_t rf_channel;
/* Status variable updated every time SPI I/O is performed */
uint8_t rf_status;
/* IRQ state is stored in here after msprf24_get_irq_reason(), RF24_IRQ_FLAGGED raised during
 * the IRQ port ISR--user application issuing LPMx sleep or polling should watch for this to
 * determine if the wakeup reason was due to nRF24 IRQ.
 */
volatile uint8_t rf_irq;





/* Library functions */
void msprf24_init()
{
	// Setup SPI
	spi_init();
	_EINT();  // Enable interrupts (set GIE in SR)

	// Setup IRQ
	#if nrfIRQport == 1
		P1DIR &= ~nrfIRQpin;  // IRQ line is input
		P1OUT |= nrfIRQpin;   // Pull-up resistor enabled
		P1REN |= nrfIRQpin;
		P1IES |= nrfIRQpin;   // Trigger on falling-edge
		P1IFG &= ~nrfIRQpin;  // Clear any outstanding IRQ
		P1IE |= nrfIRQpin;    // Enable IRQ interrupt
	#elif nrfIRQport == 2
		P2DIR &= ~nrfIRQpin;  // IRQ line is input
		P2OUT |= nrfIRQpin;   // Pull-up resistor enabled
		P2REN |= nrfIRQpin;
		P2IES |= nrfIRQpin;   // Trigger on falling-edge
		P2IFG &= ~nrfIRQpin;  // Clear any outstanding IRQ
		P2IE |= nrfIRQpin;    // Enable IRQ interrupt
	#elif nrfIRQport == 3
		P3DIR &= ~nrfIRQpin;  // IRQ line is input
		P3OUT |= nrfIRQpin;   // Pull-up resistor enabled
		P3REN |= nrfIRQpin;
		P3IES |= nrfIRQpin;   // Trigger on falling-edge
		P3IFG &= ~nrfIRQpin;  // Clear any outstanding IRQ
		P3IE |= nrfIRQpin;    // Enable IRQ interrupt
	#elif nrfIRQport == 4
		P4DIR &= ~nrfIRQpin;  // IRQ line is input
		P4OUT |= nrfIRQpin;   // Pull-up resistor enabled
		P4REN |= nrfIRQpin;
		P4IES |= nrfIRQpin;   // Trigger on falling-edge
		P4IFG &= ~nrfIRQpin;  // Clear any outstanding IRQ
		P4IE |= nrfIRQpin;    // Enable IRQ interrupt
	#elif nrfIRQport == 5
		P5DIR &= ~nrfIRQpin;  // IRQ line is input
		P5OUT |= nrfIRQpin;   // Pull-up resistor enabled
		P5REN |= nrfIRQpin;
		P5IES |= nrfIRQpin;   // Trigger on falling-edge
		P5IFG &= ~nrfIRQpin;  // Clear any outstanding IRQ
		P5IE |= nrfIRQpin;    // Enable IRQ interrupt
	#elif nrfIRQport == 6
		P6DIR &= ~nrfIRQpin;  // IRQ line is input
		P6OUT |= nrfIRQpin;   // Pull-up resistor enabled
		P6REN |= nrfIRQpin;
		P6IES |= nrfIRQpin;   // Trigger on falling-edge
		P6IFG &= ~nrfIRQpin;  // Clear any outstanding IRQ
		P6IE |= nrfIRQpin;    // Enable IRQ interrupt
	#elif nrfIRQport == 7
		P7DIR &= ~nrfIRQpin;  // IRQ line is input
		P7OUT |= nrfIRQpin;   // Pull-up resistor enabled
		P7REN |= nrfIRQpin;
		P7IES |= nrfIRQpin;   // Trigger on falling-edge
		P7IFG &= ~nrfIRQpin;  // Clear any outstanding IRQ
		P7IE |= nrfIRQpin;    // Enable IRQ interrupt
	#elif nrfIRQport == 8
		P8DIR &= ~nrfIRQpin;  // IRQ line is input
		P8OUT |= nrfIRQpin;   // Pull-up resistor enabled
		P8REN |= nrfIRQpin;
		P8IES |= nrfIRQpin;   // Trigger on falling-edge
		P8IFG &= ~nrfIRQpin;  // Clear any outstanding IRQ
		P8IE |= nrfIRQpin;    // Enable IRQ interrupt
	#elif nrfIRQport == 9
		P9DIR &= ~nrfIRQpin;  // IRQ line is input
		P9OUT |= nrfIRQpin;   // Pull-up resistor enabled
		P9REN |= nrfIRQpin;
		P9IES |= nrfIRQpin;   // Trigger on falling-edge
		P9IFG &= ~nrfIRQpin;  // Clear any outstanding IRQ
		P9IE |= nrfIRQpin;    // Enable IRQ interrupt
	#elif nrfIRQport == 10
		P10DIR &= ~nrfIRQpin;  // IRQ line is input
		P10OUT |= nrfIRQpin;   // Pull-up resistor enabled
		P10REN |= nrfIRQpin;
		P10IES |= nrfIRQpin;   // Trigger on falling-edge
		P10IFG &= ~nrfIRQpin;  // Clear any outstanding IRQ
		P10IE |= nrfIRQpin;    // Enable IRQ interrupt
	#endif

	// Setup CSN/CE ports
	#if nrfCSNport == 1
		P1DIR |= nrfCSNpin;
	#elif nrfCSNport == 2
		P2DIR |= nrfCSNpin;
	#elif nrfCSNport == 3
		P3DIR |= nrfCSNpin;
	#elif nrfCSNport == 4
		P4DIR |= nrfCSNpin;
	#elif nrfCSNport == 5
		P5DIR |= nrfCSNpin;
	#elif nrfCSNport == 6
		P6DIR |= nrfCSNpin;
	#elif nrfCSNport == 7
		P7DIR |= nrfCSNpin;
	#elif nrfCSNport == 8
		P8DIR |= nrfCSNpin;
	#elif nrfCSNport == 9
		P9DIR |= nrfCSNpin;
	#elif nrfCSNport == 10
		P10DIR |= nrfCSNpin;
	#elif nrfCSNport == J
		PJDIR |= nrfCSNpin;
	#endif
	CSN_DIS;

	#if nrfCEport == 1
		P1DIR |= nrfCEpin;
	#elif nrfCEport == 2
		P2DIR |= nrfCEpin;
	#elif nrfCEport == 3
		P3DIR |= nrfCEpin;
	#elif nrfCEport == 4
		P4DIR |= nrfCEpin;
	#elif nrfCEport == 5
		P5DIR |= nrfCEpin;
	#elif nrfCEport == 6
		P6DIR |= nrfCEpin;
	#elif nrfCEport == 7
		P7DIR |= nrfCEpin;
	#elif nrfCEport == 8
		P8DIR |= nrfCEpin;
	#elif nrfCEport == 9
		P9DIR |= nrfCEpin;
	#elif nrfCEport == 10
		P10DIR |= nrfCEpin;
	#elif nrfCEport == J
		PJDIR |= nrfCEpin;
	#endif
	CE_DIS;

	/* Straw-man spi_transfer with no Chip Select lines enabled; this is to workaround errata bug USI5
	 * on the MSP430G2452 and related (see http://www.ti.com/lit/er/slaz072/slaz072.pdf)
	 * Shouldn't hurt anything since we expect no CS lines enabled by the user during this function's execution.
	 */
	spi_transfer(RF24_NOP);

	// Wait 100ms for RF transceiver to initialize.
	uint8_t c = 20;
	for (; c; c--) {
		__delay_cycles(DELAY_CYCLES_5MS);
	}

	// Configure RF transceiver with current value of rf_* configuration variables
	msprf24_irq_clear(RF24_IRQ_MASK);  // Forget any outstanding IRQs
	msprf24_close_pipe_all();          /* Start off with no pipes enabled, let the user open as needed.  This also
					    * clears the DYNPD register.
					    */
	msprf24_set_retransmit_delay(2000);  // A default I chose
	msprf24_set_retransmit_count(15);    // A default I chose
	msprf24_set_speed_power();
	msprf24_set_channel();
	msprf24_set_address_width();
	rf_feature = 0x00;  // Initialize this so we're starting from a clean slate
	msprf24_enable_feature(RF24_EN_DPL);      // Dynamic payload size capability (set with msprf24_set_pipe_packetsize(x, 0))
	msprf24_enable_feature(RF24_EN_DYN_ACK);  // Ability to use w_tx_payload_noack()

	msprf24_powerdown();
	flush_tx();
	flush_rx();
}

void msprf24_enable_feature(uint8_t feature)
{
	if ( (rf_feature & feature) != feature ) {
		rf_feature |= feature;
		rf_feature &= 0x07;  // Only bits 0, 1, 2 allowed to be set
		w_reg(RF24_FEATURE, rf_feature);
	}
}

