ggnguyen/eDongle/eDongle_final/msp430_nrf24l01p.c
	rf_irq = 0x00;  // Clear IRQs; afterward analyze RX FIFO to see if we should re-set RX IRQ flag.
	CSN_EN;
	rf_status = spi_transfer(RF24_STATUS | RF24_W_REGISTER);
	spi_transfer(irqflag);
	CSN_DIS;

	// Per datasheet procedure, check FIFO_STATUS to see if there's more RX FIFO data to process.
	if (irqflag & RF24_IRQ_RX) {
		CSN_EN;
		rf_status = spi_transfer(RF24_FIFO_STATUS | RF24_R_REGISTER);
		fifostat = spi_transfer(RF24_NOP);
		CSN_DIS;
		if ( !(fifostat & RF24_RX_EMPTY) )
			rf_irq |= RF24_IRQ_RX | RF24_IRQ_FLAGGED;  // Signal to user that there is remaining data, even if it's not "new"
	}
}










/*      -       -       Interrupt vectors       -       -       */

// RF transceiver IRQ handling
#if   nrfIRQport == 2
  #ifdef __GNUC__
  __attribute__((interrupt(PORT2_VECTOR)))
  void P2_IRQ (void) {
  #else
  #pragma vector = PORT2_VECTOR
  __interrupt void P2_IRQ (void) {
  #endif
	if(P2IFG & nrfIRQpin) {
		__bic_SR_register_on_exit(LPM4_bits);    // Wake up
		rf_irq |= RF24_IRQ_FLAGGED;
		P2IFG &= ~nrfIRQpin;   // Clear interrupt flag
	}
}

#elif nrfIRQport == 1
  #ifdef __GNUC__
  __attribute__((interrupt(PORT1_VECTOR)))
  void P1_IRQ (void) {
  #else
  #pragma vector = PORT1_VECTOR
  __interrupt void P1_IRQ (void) {
  #endif
	if(P1IFG & nrfIRQpin) {
		__bic_SR_register_on_exit(LPM4_bits);
		rf_irq |= RF24_IRQ_FLAGGED;
		P1IFG &= ~nrfIRQpin;
	}
}

#elif nrfIRQport == 3 && defined(P3IV_)
  #ifdef __GNUC__
  __attribute__((interrupt(PORT3_VECTOR)))
  void P3_IRQ (void) {
  #else
  #pragma vector = PORT3_VECTOR
  __interrupt void P3_IRQ (void) {
  #endif
	if (P3IFG & nrfIRQpin) {
		__bic_SR_register_on_exit(LPM4_bits);
		rf_irq |= RF24_IRQ_FLAGGED;
		P3IFG &= ~nrfIRQpin;
	}
}

#elif nrfIRQport == 4 && defined(P4IV_)
  #ifdef __GNUC__
  __attribute__((interrupt(PORT4_VECTOR)))
  void P4_IRQ (void) {
  #else
  #pragma vector = PORT4_VECTOR
  __interrupt void P4_IRQ (void) {
  #endif
	if (P4IFG & nrfIRQpin) {
		__bic_SR_register_on_exit(LPM4_bits);
		rf_irq |= RF24_IRQ_FLAGGED;
		P4IFG &= ~nrfIRQpin;
	}
}

#elif nrfIRQport == 5 && defined(P5IV_)
  #ifdef __GNUC__
  __attribute__((interrupt(PORT5_VECTOR)))
  void P5_IRQ (void) {
  #else
  #pragma vector = PORT5_VECTOR
  __interrupt void P5_IRQ (void) {
  #endif
	if (P5IFG & nrfIRQpin) {
		__bic_SR_register_on_exit(LPM4_bits);
		rf_irq |= RF24_IRQ_FLAGGED;
		P5IFG &= ~nrfIRQpin;
	}
}

#elif nrfIRQport == 6 && defined(P6IV_)
  #ifdef __GNUC__
  __attribute__((interrupt(PORT6_VECTOR)))
  void P6_IRQ (void) {
  #else
  #pragma vector = PORT6_VECTOR
  __interrupt void P6_IRQ (void) {
  #endif
	if (P6IFG & nrfIRQpin) {
		__bic_SR_register_on_exit(LPM4_bits);
		rf_irq |= RF24_IRQ_FLAGGED;
		P6IFG &= ~nrfIRQpin;
	}
}

#elif nrfIRQport == 7 && defined(P7IV_)
  #ifdef __GNUC__
  __attribute__((interrupt(PORT7_VECTOR)))
  void P7_IRQ (void) {
  #else
  #pragma vector = PORT7_VECTOR
  __interrupt void P7_IRQ (void) {
  #endif
	if (P7IFG & nrfIRQpin) {
		__bic_SR_register_on_exit(LPM4_bits);
		rf_irq |= RF24_IRQ_FLAGGED;
		P7IFG &= ~nrfIRQpin;
	}
}

#elif nrfIRQport == 8 && defined(P8IV_)
  #ifdef __GNUC__
  __attribute__((interrupt(PORT8_VECTOR)))
  void P8_IRQ (void) {
  #else
  #pragma vector = PORT8_VECTOR
  __interrupt void P8_IRQ (void) {
  #endif
	if (P8IFG & nrfIRQpin) {
		__bic_SR_register_on_exit(LPM4_bits);
		rf_irq |= RF24_IRQ_FLAGGED;
		P8IFG &= ~nrfIRQpin;
	}
}

#elif nrfIRQport == 9 && defined(P9IV_)
  #ifdef __GNUC__
  __attribute__((interrupt(PORT9_VECTOR)))
  void P9_IRQ (void) {
  #else
  #pragma vector = PORT9_VECTOR
  __interrupt void P9_IRQ (void) {
  #endif
	if (P9IFG & nrfIRQpin) {
		__bic_SR_register_on_exit(LPM4_bits);
		rf_irq |= RF24_IRQ_FLAGGED;
		P9IFG &= ~nrfIRQpin;
	}
}

#elif nrfIRQport == 10 && defined(P10IV_)
  #ifdef __GNUC__
  __attribute__((interrupt(PORT10_VECTOR)))
  void P10_IRQ (void) {
  #else
  #pragma vector = PORT10_VECTOR
  __interrupt void P10_IRQ (void) {
  #endif
	if (P10IFG & nrfIRQpin) {
		__bic_SR_register_on_exit(LPM4_bits);
		rf_irq |= RF24_IRQ_FLAGGED;
		P10IFG &= ~nrfIRQpin;
	}
}
#endif

